data/sample_04.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
    <S:Header>
        <To xmlns="http://www.w3.org/2005/08/addressing" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">http://localhost:20080/SalesML/home</To>
        <Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">calculation</Action>
        <ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
        </ReplyTo>
        <MessageID xmlns="http://www.w3.org/2005/08/addressing" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">uuid:b07dd939-ad99-44ff-bb79-f43e759f2116</MessageID>
    </S:Header>
    <S:Body wsu:Id="_5002">
        <ns3:calculationRequest xmlns:ns3="http://i3s.inverso.de/mkb/sales/tool/model/home" xmlns:ns2="http://i3s.inverso.de/mkb/sales/tool/model/type">
            <ns2:header>
                <ns2:version>1.0</ns2:version>
                <ns2:language>HU</ns2:language>
                <ns2:agentNumber>3012401</ns2:agentNumber>
                <ns2:messageNumber>0001</ns2:messageNumber>
            </ns2:header>
            <ns2:general id="0">
                <ns2:product id="1">SACH</ns2:product>
                <ns2:beginDate id="2">2011-05-05</ns2:beginDate>
                <ns2:bookingFrequency id="3">49</ns2:bookingFrequency>
                <ns2:paymentMethod id="4">2</ns2:paymentMethod>
                <ns2:valuta id="5">HUF</ns2:valuta>
            </ns2:general>
            <ns2:partnerList id="6">
                <ns2:partner id="7">
                    <ns2:partnerEntity id="8">61</ns2:partnerEntity>
                    <ns2:partnerLiability id="10">VN</ns2:partnerLiability>
                    <ns2:gender id="12" />
                    <ns2:title id="17" />
                    <ns2:firstname id="18" />
                    <ns2:lastname id="11" />
                    <ns2:birthname id="13" />
                    <ns2:mothersname id="16" />
                    <ns2:birthDate id="15">1981-05-04</ns2:birthDate>
                    <ns2:birthplace id="14" />
                    <ns2:zip id="9">2040</ns2:zip>
                    <ns2:citizenship id="19" />
                    <ns2:phone id="33">;;</ns2:phone>
                    <ns2:email id="34" />
                    <ns2:bankAccount id="35" />
                    <ns2:bankName id="36" />
                    <ns2:taxNumber id="37" />
                    <ns2:addressList id="20">
                        <ns2:address id="21">
                            <ns2:addressType id="22">H</ns2:addressType>
                            <ns2:streetHouse id="23">dummy , 1 </ns2:streetHouse>
                            <ns2:zip id="24">2040</ns2:zip>
                            <ns2:city id="25">dummy</ns2:city>
                            <ns2:country id="26">H</ns2:country>
                        </ns2:address>
                        <ns2:address id="27">
                            <ns2:addressType id="28">N</ns2:addressType>
                            <ns2:streetHouse id="29">dummy , 1 </ns2:streetHouse>
                            <ns2:zip id="30">2040</ns2:zip>
                            <ns2:city id="31">dummy</ns2:city>
                            <ns2:country id="32">H</ns2:country>
                        </ns2:address>
                    </ns2:addressList>
                </ns2:partner>
                <ns2:partner id="38">
                    <ns2:partnerEntity id="39">61</ns2:partnerEntity>
                    <ns2:partnerLiability id="41">VP</ns2:partnerLiability>
                    <ns2:gender id="43" />
                    <ns2:title id="48" />
                    <ns2:firstname id="49" />
                    <ns2:lastname id="42" />
                    <ns2:birthname id="44" />
                    <ns2:mothersname id="47" />
                    <ns2:birthDate id="46">1981-05-04</ns2:birthDate>
                    <ns2:birthplace id="45" />
                    <ns2:zip id="40">2040</ns2:zip>
                    <ns2:citizenship id="50" />
                    <ns2:phone id="64">;;</ns2:phone>
                    <ns2:email id="65" />
                    <ns2:bankAccount id="66" />
                    <ns2:bankName id="67" />
                    <ns2:taxNumber id="68" />
                    <ns2:addressList id="51">
                        <ns2:address id="52">
                            <ns2:addressType id="53">H</ns2:addressType>
                            <ns2:streetHouse id="54">dummy , 1 </ns2:streetHouse>
                            <ns2:zip id="55">2040</ns2:zip>
                            <ns2:city id="56">dummy</ns2:city>
                            <ns2:country id="57">H</ns2:country>
                        </ns2:address>
                        <ns2:address id="58">
                            <ns2:addressType id="59">N</ns2:addressType>
                            <ns2:streetHouse id="60">dummy , 1 </ns2:streetHouse>
                            <ns2:zip id="61">2040</ns2:zip>
                            <ns2:city id="62">dummy</ns2:city>
                            <ns2:country id="63">H</ns2:country>
                        </ns2:address>
                    </ns2:addressList>
                </ns2:partner>
            </ns2:partnerList>
            <ns3:homeList id="69">
                <ns3:home id="70">
                    <ns3:productHome id="71">02</ns3:productHome>
                    <ns3:contractCondition id="72">5</ns3:contractCondition>
                    <ns3:bundleAllowance>Y</ns3:bundleAllowance>
                    <ns3:specialAllowance />
                    <ns3:buildingList id="73">
                        <ns3:building id="74">
                            <ns3:buildingSpecification id="75">1</ns3:buildingSpecification>
                            <ns2:zip id="76">2040</ns2:zip>
                            <ns3:buildingType id="77">EFH</ns3:buildingType>
                            <ns3:buildingConstruction id="78">1</ns3:buildingConstruction>
                            <ns3:buildingHabitableSurface id="79">147</ns3:buildingHabitableSurface>
                            <ns3:buildingOccupied id="80">Y</ns3:buildingOccupied>
                            <ns3:buildingExploitationMethod id="81">1</ns3:buildingExploitationMethod>
                            <ns3:buildingUnderConstruction id="82">N</ns3:buildingUnderConstruction>
                            <ns3:coverageList id="83">
                                <ns3:coverage id="84">
                                    <ns2:coverageType id="85">WGB</ns2:coverageType>
                                    <ns3:insuranceSum id="86" />
                                </ns3:coverage>
                            </ns3:coverageList>
                        </ns3:building>
                        <ns3:building id="87">
                            <ns3:buildingSpecification id="88">2</ns3:buildingSpecification>
                            <ns2:zip id="89">2040</ns2:zip>
                            <ns3:buildingConstruction id="90">5</ns3:buildingConstruction>
                            <ns3:buildingHabitableSurface id="91">15</ns3:buildingHabitableSurface>
                            <ns3:buildingOccupied id="92">Y</ns3:buildingOccupied>
                            <ns3:buildingExploitationMethod id="93">7</ns3:buildingExploitationMethod>
                            <ns3:buildingUnderConstruction id="94">N</ns3:buildingUnderConstruction>
                            <ns3:coverageList id="95">
                                <ns3:coverage id="96">
                                    <ns2:coverageType id="97">WGB</ns2:coverageType>
                                    <ns3:insuranceSum id="98" />
                                </ns3:coverage>
                            </ns3:coverageList>
                        </ns3:building>
                    </ns3:buildingList>
                </ns3:home>
            </ns3:homeList>
        </ns3:calculationRequest>
    </S:Body>
</S:Envelope>
